In [1]:
import pandas as pd
#reading the csv file
df =pd.read_csv('wine.csv')

In [6]:
import pandas as pd

mydataset={
    'cars':['BMW','Volvo','Ford'],
    'passings':[3,7,2],
    'year': [2019,2018,2017]
}

myvar=pd.DataFrame(mydataset)
myvar.head()

    cars  passings  year
0    BMW         3  2019
1  Volvo         7  2018
2   Ford         2  2017

In [9]:
import pandas as pd
pd.__version__

'1.5.2'

# pandas series

pandas series is like column in a table that is one dimensional

~~not multidimensional~~

[w3schools](w3schools.com/python/pandas/)

In [13]:
# pip list
a=[1,7,2]
myvar=pd.Series(a)
print(myvar)

0    1
1    7
2    2
dtype: int64

### creating labels in pd series

In [16]:
a=[1,7,2]
# using the index parameter to name the rows
myvar=pd.Series(a,index=["x","y","z"])
print(myvar)
#you can print the value usning the index
print(myvar["x"])

x    1
y    7
z    2
dtype: int64
1

In [17]:
#can also use a key:value object, and if no index is specified, the index will be the same as the keys
import pandas as pd
calories ={'day1':420,'day2':380,'day3':390}
myvar=pd.Series(calories)
print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [19]:
import pandas as pd

calories ={'day1':420,'day2':380,'day3':390}
myvar=pd.Series(calories,index=['day1','day2','day3'])
print(myvar)

day1    420
day2    380
day3    390
dtype: int64

# DataFrames

In [20]:
import pandas as pd
data ={'hello':[10,23,12],
        'world':[20,30,40]
    }
myvar=pd.DataFrame(data)
print(myvar)

   hello  world
0     10     20
1     23     30
2     12     40

In [23]:
import pandas as pd

data={
    'hello':(10,23,34,45),
    'world':(20,30,40,50),
    'bye':(30,40,50,60)
}
myvar=pd.DataFrame(data)
print(myvar)

   hello  world  bye
0     10     20   30
1     23     30   40
2     34     40   50
3     45     50   60

In [2]:
import numpy as np
from numpy.random import randn
np.random.seed(101)
import pandas as pd

In [19]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
print(df)

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

## selection and indexing

In [15]:
# df['W']
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [20]:
df['new']=df['X']+df['Z']
print(df)

          W         X         Y         Z       new
A -0.993263  0.196800 -1.136645  0.000366  0.197166
B  1.025984 -0.156598 -0.031579  0.649826  0.493228
C  2.154846 -0.610259 -0.755325 -0.346419 -0.956677
D  0.147027 -0.479448  0.558769  1.024810  0.545362
E -0.925874  1.862864 -1.133817  0.610478  2.473342

In [21]:
df.drop('new',axis=1,inplace=True)
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [ ]:
#we can drow rows as well

df.drop('E',axis=0)

## locating

In [23]:
#locating an element or row
#df.loc is used for selecting rows
df.loc['A']

W   -0.993263
X    0.196800
Y   -1.136645
Z    0.000366
Name: A, dtype: float64

In [25]:
#selecting based on position instead of label

df.iloc[2]

W    2.154846
X   -0.610259
Y   -0.755325
Z   -0.346419
Name: C, dtype: float64

In [26]:
df.loc['B','Y']

-0.031579143908112575

In [27]:
df.loc[['A','B'],['W',"Y"]]

          W         Y
A -0.993263 -1.136645
B  1.025984 -0.031579

## conditional selection

In [28]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [29]:
df>0

       W      X      Y      Z
A  False   True  False   True
B   True  False  False   True
C   True  False  False  False
D   True  False   True   True
E  False   True  False   True

In [30]:
df[df>0]

          W         X         Y         Z
A       NaN  0.196800       NaN  0.000366
B  1.025984       NaN       NaN  0.649826
C  2.154846       NaN       NaN       NaN
D  0.147027       NaN  0.558769  1.024810
E       NaN  1.862864       NaN  0.610478

In [33]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [34]:
df[df['W']>0][['Y','X']]

          Y         X
B -0.031579 -0.156598
C -0.755325 -0.610259
D  0.558769 -0.479448

In [37]:
df[(df['W']>0) & (df['Y']>1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

## More index details

In [38]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.993263  0.196800 -1.136645  0.000366
1     B  1.025984 -0.156598 -0.031579  0.649826
2     C  2.154846 -0.610259 -0.755325 -0.346419
3     D  0.147027 -0.479448  0.558769  1.024810
4     E -0.925874  1.862864 -1.133817  0.610478

In [41]:
newind= 'CA NY WY OR CO'.split()
print(newind)
df['States']=newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [42]:
df

          W         X         Y         Z States
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     NY
C  2.154846 -0.610259 -0.755325 -0.346419     WY
D  0.147027 -0.479448  0.558769  1.024810     OR
E -0.925874  1.862864 -1.133817  0.610478     CO

In [43]:
df.set_index('States')

               W         X         Y         Z
States
CA     -0.993263  0.196800 -1.136645  0.000366
NY      1.025984 -0.156598 -0.031579  0.649826
WY      2.154846 -0.610259 -0.755325 -0.346419
OR      0.147027 -0.479448  0.558769  1.024810
CO     -0.925874  1.862864 -1.133817  0.610478

# Missing Data

In [45]:
import numpy as np
import pandas as pd

In [51]:
df=pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3],'D':[5,np.nan,np.nan]})
df

     A    B  C    D
0  1.0  5.0  1  5.0
1  2.0  NaN  2  NaN
2  NaN  NaN  3  NaN

In [52]:
df.dropna()

     A    B  C    D
0  1.0  5.0  1  5.0

In [53]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [56]:
df.dropna(thresh=2,axis=1)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [61]:
df

     A    B  C    D
0  1.0  5.0  1  5.0
1  2.0  NaN  2  NaN
2  NaN  NaN  3  NaN

In [63]:
df['A'].fillna(value=df['A'].mean())
df['D'].fillna(value=df['D'].mean())
df

     A    B  C    D
0  1.0  5.0  1  5.0
1  2.0  NaN  2  NaN
2  NaN  NaN  3  NaN

# Groupby

In [64]:
import numpy as np
import pandas as pd

data= {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]}

In [65]:
df=pd.DataFrame(data)

In [66]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [72]:
by_comp=df.groupby('Company')
print(by_comp)
by_comp.mean()

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000283F8F9ED30>

C:\Users\Amit Yadav\AppData\Local\Temp\ipykernel_18136\3404345676.py:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [74]:
by_comp.min()
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [75]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [87]:
df.transpose()

            0        1     2        3     4      5
Company  GOOG     GOOG  MSFT     MSFT    FB     FB
Person    Sam  Charlie   Amy  Vanessa  Carl  Sarah
Sales     200      120   340      124   243    350

In [89]:
df.transpose().reset_index(drop=True).set_index(0)

            1     2        3     4      5
0
GOOG     GOOG  MSFT     MSFT    FB     FB
Sam   Charlie   Amy  Vanessa  Carl  Sarah
200       120   340      124   243    350